<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="description" content="Description not defined">
    <title>C++ class size</title>
    <script async src="https://ackee.intmain.io/tracker.js" data-ackee-server="https://ackee.intmain.io" data-ackee-domain-id="ae2b54a4-84be-4e13-9143-062488243a8c"></script>
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.7.0/styles/base16/materia.min.css">
    <script src="//cdnjs.cloudflare.com/ajax/libs/highlight.js/11.7.0/highlight.min.js"></script>
    <script src="//cdnjs.cloudflare.com/ajax/libs/highlightjs-line-numbers.js/2.8.0/highlightjs-line-numbers.min.js"></script>
    <script async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-6442897272752686" crossorigin="anonymous"></script>
    <link rel="stylesheet" href="/styles.css">
  </head>
  <body class="bg-black">
    <nav class="bg-slate-800 text-blue-400 border-gray-200 px-2 sm:px-4 py-2.5">
      <div class="container flex flex-wrap justify-between items-center mx-auto"><a class="flex items-center" href="/"><img class="mr-3 h-6 sm:h-9" src="/logo.svg" alt="Geraldo Ribeiro"><span class="self-center text-xl font-semibold whitespace-nowrap underline-offset-8 hover:underline hover:text-white">Geraldo Ribeiro </span></a>

<h2 id="union-%E2%80%94-many-attributes-on-same-memory-location" tabindex="-1">Union — many attributes on same memory location</h2>
<pre><code class="language-cpp">  typedef union {
    char a;
    int b;
  } a_union_t;
  CHECK_SIZE_AND_ALIGNMENT(a_union_t, 4, 4);
  cout &lt;&lt; &quot;Offset of a_union_t::a &quot; &lt;&lt; offsetof(a_union_t, a) &lt;&lt; endl;  // 0
  cout &lt;&lt; &quot;Offset of a_union_t::b &quot; &lt;&lt; offsetof(a_union_t, b) &lt;&lt; endl;  // 0
</code></pre>
<figure>
  <img class="mx-auto" src="/til/cpp_a_union_t.svg" alt="Memory usage by a_union_t.">
  <figcaption class="text-center">
     <strong>Fig. 2</strong> - <span>Memory usage by a_union_t.</span>
  </figcaption>
</figure>
<h2 id="default-member-size-alignment" tabindex="-1">Default member size alignment</h2>
<pre><code class="language-cpp">  typedef struct {
    char a;
    int b;
  } b_struct_t;
  CHECK_SIZE_AND_ALIGNMENT(b_struct_t, 8, 4);

  cout &lt;&lt; &quot;Offset of b_struct_t::a &quot; &lt;&lt; offsetof(b_struct_t, a) &lt;&lt; endl;  // 0
  cout &lt;&lt; &quot;Offset of b_struct_t::b &quot; &lt;&lt; offsetof(b_struct_t, b) &lt;&lt; endl;  // 4
</code></pre>
<figure>
  <img class="mx-auto" src="/til/cpp_b_struct_t.svg" alt="Memory usage by b_struct_t.">
  <figcaption class="text-center">
     <strong>Fig. 3</strong> - <span>Memory usage by b_struct_t.</span>
  </figcaption>
</figure>
<pre><code class="language-cpp">  class c_class {
   public:
    char a;
    int b;
    int f1() { return 1; }
    int f2() { return 2; }
    int f3() { return 3; }
    int f4() { return 4; }
  };
  CHECK_SIZE_AND_ALIGNMENT(c_class, 8, 4);
  cout &lt;&lt; &quot;Offset of c_class::a &quot; &lt;&lt; offsetof(c_class, a) &lt;&lt; endl;  // 0
  cout &lt;&lt; &quot;Offset of c_class::b &quot; &lt;&lt; offsetof(c_class, b) &lt;&lt; endl;  // 4
</code></pre>
<div role="alert" class="my-4">
  <div class="bg-green-500 text-white font-bold rounded-t px-4 py-2">
    <span class="text-2xl">⚡</span>
    <span>Tip</span>
  </div>
  <div class="border border-t-0 border-green-400 rounded-b px-4 py-3">
<p>Functions does not changes the class size.</p>
  </div>
</div>
<figure>
  <img class="mx-auto" src="/til/cpp_c_class.svg" alt="Memory usage by c_class.">
  <figcaption class="text-center">
     <strong>Fig. 4</strong> - <span>Memory usage by c_class.</span>
  </figcaption>
</figure>
<pre><code class="language-cpp">  class d_class {
   public:
    char a;
    int b;
    virtual ~d_class(){};
  };
  CHECK_SIZE_AND_ALIGNMENT(d_class, 16, 8);
  // warning: offset of on non-standard-layout type 'd_class'
  // [-Winvalid-offsetof]
  // cout &lt;&lt; &quot;Offset of d_class::a &quot; &lt;&lt; offsetof(d_class, a) &lt;&lt; endl;  // ?
  // cout &lt;&lt; &quot;Offset of d_class::b &quot; &lt;&lt; offsetof(d_class, b) &lt;&lt; endl;  // ?
  //
  // *** Dumping AST Record Layout
  //          0 | class d_class
  //          0 |   (d_class vtable pointer)
  //          8 |   char a
  //         12 |   int b
  //            | [sizeof=16, dsize=16, align=8,
  //            |  nvsize=16, nvalign=8]
</code></pre>
<div role="alert" class="my-4">
  <div class="bg-green-500 text-white font-bold rounded-t px-4 py-2">
    <span class="text-2xl">⚡</span>
    <span>Tip</span>
  </div>
  <div class="border border-t-0 border-green-400 rounded-b px-4 py-3">
<p>The <code>virtual</code> keyword include a virtual table attribute.</p>
  </div>
</div>
<figure>
  <img class="mx-auto" src="/til/cpp_d_class.svg" alt="Memory usage by d_class.">
  <figcaption class="text-center">
     <strong>Fig. 5</strong> - <span>Memory usage by d_class.</span>
  </figcaption>
</figure>
<pre><code class="language-cpp">  class e_class {
   public:
    char a;
    int b;
    ~e_class(){};
  };
  CHECK_SIZE_AND_ALIGNMENT(e_class, 8, 4);
  cout &lt;&lt; &quot;Offset of e_class::a &quot; &lt;&lt; offsetof(e_class, a) &lt;&lt; endl;  // ?
  cout &lt;&lt; &quot;Offset of e_class::b &quot; &lt;&lt; offsetof(e_class, b) &lt;&lt; endl;  // ?
  //
  // *** Dumping AST Record Layout
  //          0 | class e_class
  //          0 |   char a
  //          4 |   int b
  //            | [sizeof=8, dsize=8, align=4,
  //            |  nvsize=8, nvalign=4]
</code></pre>
<figure>
  <img class="mx-auto" src="/til/cpp_e_class.svg" alt="Memory usage by e_class.">
  <figcaption class="text-center">
     <strong>Fig. 6</strong> - <span>Memory usage by e_class.</span>
  </figcaption>
</figure>
<pre><code class="language-cpp">  class f_class {
   public:
    char a;   // 4
    int b;    // 4
    float c;  // 4
    ~f_class(){};
  };
  CHECK_SIZE_AND_ALIGNMENT(f_class, 12, 4);

  is_new_print_enabled = true;
  {
    auto f_class_obj_1 = new f_class;             // Allocating 12 bytes
    auto f_class_obj_2 = make_unique&lt;f_class&gt;();  // Allocating 12 bytes
    auto f_class_obj_3 = make_shared&lt;f_class&gt;();  // Allocating 32 bytes

    cout &lt;&lt; &quot;Offset of f_class::a &quot; &lt;&lt; offsetof(f_class, a) &lt;&lt; endl;  // 0
    cout &lt;&lt; &quot;Offset of f_class::b &quot; &lt;&lt; offsetof(f_class, b) &lt;&lt; endl;  // 4
